stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wba62xx.h
/*******************  Bits definition for GTZC_TZSC_PRIVCFGR2 register  ***************/
#define GTZC_TZSC_PRIVCFGR2_TIM1PRIV_Pos           (0UL)
#define GTZC_TZSC_PRIVCFGR2_TIM1PRIV_Msk           (0x01UL << GTZC_TZSC_PRIVCFGR2_TIM1PRIV_Pos)
#define GTZC_TZSC_PRIVCFGR2_TIM1PRIV               GTZC_TZSC_PRIVCFGR2_TIM1PRIV_Msk               /*!<  privileged access mode for TIM1 */
#define GTZC_TZSC_PRIVCFGR2_SPI1PRIV_Pos           (1UL)
#define GTZC_TZSC_PRIVCFGR2_SPI1PRIV_Msk           (0x01UL << GTZC_TZSC_PRIVCFGR2_SPI1PRIV_Pos)
#define GTZC_TZSC_PRIVCFGR2_SPI1PRIV               GTZC_TZSC_PRIVCFGR2_SPI1PRIV_Msk               /*!<  privileged access mode for SPI1 */
#define GTZC_TZSC_PRIVCFGR2_USART1PRIV_Pos         (3UL)
#define GTZC_TZSC_PRIVCFGR2_USART1PRIV_Msk         (0x01UL << GTZC_TZSC_PRIVCFGR2_USART1PRIV_Pos)
#define GTZC_TZSC_PRIVCFGR2_USART1PRIV             GTZC_TZSC_PRIVCFGR2_USART1PRIV_Msk             /*!<  privileged access mode for USART1 */
#define GTZC_TZSC_PRIVCFGR2_TIM16PRIV_Pos          (5UL)
#define GTZC_TZSC_PRIVCFGR2_TIM16PRIV_Msk          (0x01UL << GTZC_TZSC_PRIVCFGR2_TIM16PRIV_Pos)
#define GTZC_TZSC_PRIVCFGR2_TIM16PRIV              GTZC_TZSC_PRIVCFGR2_TIM16PRIV_Msk              /*!<  privileged access mode for TIM16 */
#define GTZC_TZSC_PRIVCFGR2_TIM17PRIV_Pos          (6UL)
#define GTZC_TZSC_PRIVCFGR2_TIM17PRIV_Msk          (0x01UL << GTZC_TZSC_PRIVCFGR2_TIM17PRIV_Pos)
#define GTZC_TZSC_PRIVCFGR2_TIM17PRIV              GTZC_TZSC_PRIVCFGR2_TIM17PRIV_Msk              /*!<  privileged access mode for TIM17 */
#define GTZC_TZSC_PRIVCFGR2_SAI1PRIV_Pos           (7UL)
#define GTZC_TZSC_PRIVCFGR2_SAI1PRIV_Msk           (0x01UL << GTZC_TZSC_PRIVCFGR2_SAI1PRIV_Pos)
#define GTZC_TZSC_PRIVCFGR2_SAI1PRIV               GTZC_TZSC_PRIVCFGR2_SAI1PRIV_Msk               /*!<  privileged access mode for SAI1 */
#define GTZC_TZSC_PRIVCFGR2_SPI3PRIV_Pos           (16UL)
#define GTZC_TZSC_PRIVCFGR2_SPI3PRIV_Msk           (0x01UL << GTZC_TZSC_PRIVCFGR2_SPI3PRIV_Pos)
#define GTZC_TZSC_PRIVCFGR2_SPI3PRIV               GTZC_TZSC_PRIVCFGR2_SPI3PRIV_Msk               /*!<  privileged access mode for SPI3 */
#define GTZC_TZSC_PRIVCFGR2_LPUART1PRIV_Pos        (17UL)
#define GTZC_TZSC_PRIVCFGR2_LPUART1PRIV_Msk        (0x01UL << GTZC_TZSC_PRIVCFGR2_LPUART1PRIV_Pos)
#define GTZC_TZSC_PRIVCFGR2_LPUART1PRIV            GTZC_TZSC_PRIVCFGR2_LPUART1PRIV_Msk            /*!<  privileged access mode for LPUART1 */
#define GTZC_TZSC_PRIVCFGR2_I2C3PRIV_Pos           (18UL)
#define GTZC_TZSC_PRIVCFGR2_I2C3PRIV_Msk           (0x01UL << GTZC_TZSC_PRIVCFGR2_I2C3PRIV_Pos)
#define GTZC_TZSC_PRIVCFGR2_I2C3PRIV               GTZC_TZSC_PRIVCFGR2_I2C3PRIV_Msk               /*!<  privileged access mode for I2C3 */
#define GTZC_TZSC_PRIVCFGR2_LPTIM1PRIV_Pos         (19UL)
#define GTZC_TZSC_PRIVCFGR2_LPTIM1PRIV_Msk         (0x01UL << GTZC_TZSC_PRIVCFGR2_LPTIM1PRIV_Pos)
#define GTZC_TZSC_PRIVCFGR2_LPTIM1PRIV             GTZC_TZSC_PRIVCFGR2_LPTIM1PRIV_Msk             /*!<  privileged access mode for LPTIM1 */
#define GTZC_TZSC_PRIVCFGR2_COMPPRIV_Pos           (23UL)
#define GTZC_TZSC_PRIVCFGR2_COMPPRIV_Msk           (0x01UL << GTZC_TZSC_PRIVCFGR2_COMPPRIV_Pos)
#define GTZC_TZSC_PRIVCFGR2_COMPPRIV               GTZC_TZSC_PRIVCFGR2_COMPPRIV_Msk               /*!<  privileged access mode for COMP */
#define GTZC_TZSC_PRIVCFGR2_ADC4PRIV_Pos           (24UL)
#define GTZC_TZSC_PRIVCFGR2_ADC4PRIV_Msk           (0x01UL << GTZC_TZSC_PRIVCFGR2_ADC4PRIV_Pos)
#define GTZC_TZSC_PRIVCFGR2_ADC4PRIV               GTZC_TZSC_PRIVCFGR2_ADC4PRIV_Msk               /*!<  privileged access mode for ADC4 */
#define GTZC_TZSC_PRIVCFGR2_VREFBUFPRIV_Pos        (25UL)
#define GTZC_TZSC_PRIVCFGR2_VREFBUFPRIV_Msk        (0x01UL << GTZC_TZSC_PRIVCFGR2_VREFBUFPRIV_Pos)
#define GTZC_TZSC_PRIVCFGR2_VREFBUFPRIV            GTZC_TZSC_PRIVCFGR2_VREFBUFPRIV_Msk            /*!<  privileged access mode for VREFBUF */

/*******************  Bits definition for GTZC_TZSC_PRIVCFGR3 register  ***************/
#define GTZC_TZSC_PRIVCFGR3_CRCPRIV_Pos            (3UL)
#define GTZC_TZSC_PRIVCFGR3_CRCPRIV_Msk            (0x01UL << GTZC_TZSC_PRIVCFGR3_CRCPRIV_Pos)
#define GTZC_TZSC_PRIVCFGR3_CRCPRIV                GTZC_TZSC_PRIVCFGR3_CRCPRIV_Msk                /*!<  privileged access mode for CRC */
#define GTZC_TZSC_PRIVCFGR3_TSCPRIV_Pos            (4UL)
#define GTZC_TZSC_PRIVCFGR3_TSCPRIV_Msk            (0x01UL << GTZC_TZSC_PRIVCFGR3_TSCPRIV_Pos)
#define GTZC_TZSC_PRIVCFGR3_TSCPRIV                GTZC_TZSC_PRIVCFGR3_TSCPRIV_Msk                /*!<  privileged access mode for TSC */
#define GTZC_TZSC_PRIVCFGR3_ICACHE_REGPRIV_Pos     (6UL)
#define GTZC_TZSC_PRIVCFGR3_ICACHE_REGPRIV_Msk     (0x01UL << GTZC_TZSC_PRIVCFGR3_ICACHE_REGPRIV_Pos)
#define GTZC_TZSC_PRIVCFGR3_ICACHE_REGPRIV         GTZC_TZSC_PRIVCFGR3_ICACHE_REGPRIV_Msk         /*!<  privileged access mode for ICACHE_REG */
#define GTZC_TZSC_PRIVCFGR3_OTGPRIV_Pos            (10UL)
#define GTZC_TZSC_PRIVCFGR3_OTGPRIV_Msk            (0x01UL << GTZC_TZSC_PRIVCFGR3_OTGPRIV_Pos)
#define GTZC_TZSC_PRIVCFGR3_OTGPRIV                GTZC_TZSC_PRIVCFGR3_OTGPRIV_Msk                /*!<  privileged access mode for OTG */
#define GTZC_TZSC_PRIVCFGR3_AESPRIV_Pos            (11UL)
#define GTZC_TZSC_PRIVCFGR3_AESPRIV_Msk            (0x01UL << GTZC_TZSC_PRIVCFGR3_AESPRIV_Pos)
#define GTZC_TZSC_PRIVCFGR3_AESPRIV                GTZC_TZSC_PRIVCFGR3_AESPRIV_Msk                /*!<  privileged access mode for AES */
#define GTZC_TZSC_PRIVCFGR3_HASHPRIV_Pos           (12UL)
#define GTZC_TZSC_PRIVCFGR3_HASHPRIV_Msk           (0x01UL << GTZC_TZSC_PRIVCFGR3_HASHPRIV_Pos)
#define GTZC_TZSC_PRIVCFGR3_HASHPRIV               GTZC_TZSC_PRIVCFGR3_HASHPRIV_Msk               /*!<  privileged access mode for HASH */
#define GTZC_TZSC_PRIVCFGR3_RNGPRIV_Pos            (13UL)
#define GTZC_TZSC_PRIVCFGR3_RNGPRIV_Msk            (0x01UL << GTZC_TZSC_PRIVCFGR3_RNGPRIV_Pos)
#define GTZC_TZSC_PRIVCFGR3_RNGPRIV                GTZC_TZSC_PRIVCFGR3_RNGPRIV_Msk                /*!<  privileged access mode for RNG */
#define GTZC_TZSC_PRIVCFGR3_SAESPRIV_Pos           (14UL)
#define GTZC_TZSC_PRIVCFGR3_SAESPRIV_Msk           (0x01UL << GTZC_TZSC_PRIVCFGR3_SAESPRIV_Pos)
#define GTZC_TZSC_PRIVCFGR3_SAESPRIV               GTZC_TZSC_PRIVCFGR3_SAESPRIV_Msk               /*!<  privileged access mode for SAES */
#define GTZC_TZSC_PRIVCFGR3_PKAPRIV_Pos            (16UL)
#define GTZC_TZSC_PRIVCFGR3_PKAPRIV_Msk            (0x01UL << GTZC_TZSC_PRIVCFGR3_PKAPRIV_Pos)
#define GTZC_TZSC_PRIVCFGR3_PKAPRIV                GTZC_TZSC_PRIVCFGR3_PKAPRIV_Msk                /*!<  privileged access mode for PKA */
#define GTZC_TZSC_PRIVCFGR3_RAMCFGPRIV_Pos         (22UL)
#define GTZC_TZSC_PRIVCFGR3_RAMCFGPRIV_Msk         (0x01UL << GTZC_TZSC_PRIVCFGR3_RAMCFGPRIV_Pos)
#define GTZC_TZSC_PRIVCFGR3_RAMCFGPRIV             GTZC_TZSC_PRIVCFGR3_RAMCFGPRIV_Msk             /*!<  privileged access mode for RAMCFG */
#define GTZC_TZSC_PRIVCFGR3_RADIOPRIV_Pos          (23UL)
#define GTZC_TZSC_PRIVCFGR3_RADIOPRIV_Msk          (0x01UL << GTZC_TZSC_PRIVCFGR3_RADIOPRIV_Pos)
#define GTZC_TZSC_PRIVCFGR3_RADIOPRIV              GTZC_TZSC_PRIVCFGR3_RADIOPRIV_Msk              /*!<  privileged access mode for 2.4 GHz RADIO */
#define GTZC_TZSC_PRIVCFGR3_PTACONVPRIV_Pos        (24UL)
#define GTZC_TZSC_PRIVCFGR3_PTACONVPRIV_Msk        (0x01UL << GTZC_TZSC_PRIVCFGR3_PTACONVPRIV_Pos)
#define GTZC_TZSC_PRIVCFGR3_PTACONVPRIV            GTZC_TZSC_PRIVCFGR3_PTACONVPRIV_Msk            /*!<  privileged access mode for PTACONV */

/*******************  Bits definition for GTZC_TZIC_IER1 register  ***************/
#define GTZC_TZIC_IER1_TIM2IE_Pos           (0UL)
#define GTZC_TZIC_IER1_TIM2IE_Msk           (0x01UL << GTZC_TZIC_IER1_TIM2IE_Pos)
#define GTZC_TZIC_IER1_TIM2IE               GTZC_TZIC_IER1_TIM2IE_Msk               /*!<   illegal access interrupt enable for TIM2 */
#define GTZC_TZIC_IER1_TIM3IE_Pos           (1UL)
#define GTZC_TZIC_IER1_TIM3IE_Msk           (0x01UL << GTZC_TZIC_IER1_TIM3IE_Pos)
#define GTZC_TZIC_IER1_TIM3IE               GTZC_TZIC_IER1_TIM3IE_Msk               /*!<   illegal access interrupt enable for TIM3 */
#define GTZC_TZIC_IER1_TIM4IE_Pos           (2UL)
#define GTZC_TZIC_IER1_TIM4IE_Msk           (0x01UL << GTZC_TZIC_IER1_TIM4IE_Pos)
#define GTZC_TZIC_IER1_TIM4IE               GTZC_TZIC_IER1_TIM4IE_Msk               /*!<   illegal access interrupt enable for TIM4 */
#define GTZC_TZIC_IER1_WWDGIE_Pos           (6UL)
#define GTZC_TZIC_IER1_WWDGIE_Msk           (0x01UL << GTZC_TZIC_IER1_WWDGIE_Pos)
#define GTZC_TZIC_IER1_WWDGIE               GTZC_TZIC_IER1_WWDGIE_Msk               /*!<   illegal access interrupt enable for WWDG */
#define GTZC_TZIC_IER1_IWDGIE_Pos           (7UL)
#define GTZC_TZIC_IER1_IWDGIE_Msk           (0x01UL << GTZC_TZIC_IER1_IWDGIE_Pos)
#define GTZC_TZIC_IER1_IWDGIE               GTZC_TZIC_IER1_IWDGIE_Msk               /*!<   illegal access interrupt enable for IWDG */
#define GTZC_TZIC_IER1_SPI2IE_Pos           (8UL)
#define GTZC_TZIC_IER1_SPI2IE_Msk           (0x01UL << GTZC_TZIC_IER1_SPI2IE_Pos)
#define GTZC_TZIC_IER1_SPI2IE               GTZC_TZIC_IER1_SPI2IE_Msk               /*!<   illegal access interrupt enable for IWDG */
#define GTZC_TZIC_IER1_USART2IE_Pos         (9UL)
#define GTZC_TZIC_IER1_USART2IE_Msk         (0x01UL << GTZC_TZIC_IER1_USART2IE_Pos)
#define GTZC_TZIC_IER1_USART2IE             GTZC_TZIC_IER1_USART2IE_Msk             /*!<   illegal access interrupt enable for USART2 */
#define GTZC_TZIC_IER1_USART3IE_Pos         (10UL)
#define GTZC_TZIC_IER1_USART3IE_Msk         (0x01UL << GTZC_TZIC_IER1_USART3IE_Pos)
#define GTZC_TZIC_IER1_USART3IE             GTZC_TZIC_IER1_USART3IE_Msk             /*!<   illegal access interrupt enable for USART3 */
#define GTZC_TZIC_IER1_I2C1IE_Pos           (13UL)
#define GTZC_TZIC_IER1_I2C1IE_Msk           (0x01UL << GTZC_TZIC_IER1_I2C1IE_Pos)
#define GTZC_TZIC_IER1_I2C1IE               GTZC_TZIC_IER1_I2C1IE_Msk               /*!<   illegal access interrupt enable for I2C1 */
#define GTZC_TZIC_IER1_I2C2IE_Pos           (14UL)
#define GTZC_TZIC_IER1_I2C2IE_Msk           (0x01UL << GTZC_TZIC_IER1_I2C2IE_Pos)
#define GTZC_TZIC_IER1_I2C2IE               GTZC_TZIC_IER1_I2C2IE_Msk               /*!<   illegal access interrupt enable for I2C2 */
#define GTZC_TZIC_IER1_I2C4IE_Pos           (16UL)
#define GTZC_TZIC_IER1_I2C4IE_Msk           (0x01UL << GTZC_TZIC_IER1_I2C4IE_Pos)
#define GTZC_TZIC_IER1_I2C4IE               GTZC_TZIC_IER1_I2C4IE_Msk               /*!<   illegal access interrupt enable for I2C4 */
#define GTZC_TZIC_IER1_LPTIM2IE_Pos         (17UL)
#define GTZC_TZIC_IER1_LPTIM2IE_Msk         (0x01UL << GTZC_TZIC_IER1_LPTIM2IE_Pos)
#define GTZC_TZIC_IER1_LPTIM2IE             GTZC_TZIC_IER1_LPTIM2IE_Msk             /*!<   illegal access interrupt enable for LPTIM2 */

/*******************  Bits definition for GTZC_TZIC_IER2 register  ***************/
#define GTZC_TZIC_IER2_TIM1IE_Pos           (0UL)
#define GTZC_TZIC_IER2_TIM1IE_Msk           (0x01UL << GTZC_TZIC_IER2_TIM1IE_Pos)
#define GTZC_TZIC_IER2_TIM1IE               GTZC_TZIC_IER2_TIM1IE_Msk               /*!<  illegal access interrupt enable for TIM1 */
#define GTZC_TZIC_IER2_SPI1IE_Pos           (1UL)
#define GTZC_TZIC_IER2_SPI1IE_Msk           (0x01UL << GTZC_TZIC_IER2_SPI1IE_Pos)
#define GTZC_TZIC_IER2_SPI1IE               GTZC_TZIC_IER2_SPI1IE_Msk               /*!<  illegal access interrupt enable for SPI1 */
#define GTZC_TZIC_IER2_USART1IE_Pos         (3UL)
#define GTZC_TZIC_IER2_USART1IE_Msk         (0x01UL << GTZC_TZIC_IER2_USART1IE_Pos)
#define GTZC_TZIC_IER2_USART1IE             GTZC_TZIC_IER2_USART1IE_Msk             /*!<  illegal access interrupt enable for USART1 */
#define GTZC_TZIC_IER2_TIM16IE_Pos          (5UL)
#define GTZC_TZIC_IER2_TIM16IE_Msk          (0x01UL << GTZC_TZIC_IER2_TIM16IE_Pos)
#define GTZC_TZIC_IER2_TIM16IE              GTZC_TZIC_IER2_TIM16IE_Msk              /*!<  illegal access interrupt enable for TIM16 */
#define GTZC_TZIC_IER2_TIM17IE_Pos          (6UL)
#define GTZC_TZIC_IER2_TIM17IE_Msk          (0x01UL << GTZC_TZIC_IER2_TIM17IE_Pos)
#define GTZC_TZIC_IER2_TIM17IE              GTZC_TZIC_IER2_TIM17IE_Msk              /*!<  illegal access interrupt enable for TIM17 */
#define GTZC_TZIC_IER2_SAI1IE_Pos           (7UL)
#define GTZC_TZIC_IER2_SAI1IE_Msk           (0x01UL << GTZC_TZIC_IER2_SAI1IE_Pos)
#define GTZC_TZIC_IER2_SAI1IE               GTZC_TZIC_IER2_SAI1IE_Msk               /*!<  illegal access interrupt enable for SAI1 */
#define GTZC_TZIC_IER2_SPI3IE_Pos           (16UL)
#define GTZC_TZIC_IER2_SPI3IE_Msk           (0x01UL << GTZC_TZIC_IER2_SPI3IE_Pos)
#define GTZC_TZIC_IER2_SPI3IE               GTZC_TZIC_IER2_SPI3IE_Msk               /*!<  illegal access interrupt enable for SPI3 */
#define GTZC_TZIC_IER2_LPUART1IE_Pos        (17UL)
#define GTZC_TZIC_IER2_LPUART1IE_Msk        (0x01UL << GTZC_TZIC_IER2_LPUART1IE_Pos)
#define GTZC_TZIC_IER2_LPUART1IE            GTZC_TZIC_IER2_LPUART1IE_Msk            /*!<  illegal access interrupt enable for LPUART1 */
#define GTZC_TZIC_IER2_I2C3IE_Pos           (18UL)
#define GTZC_TZIC_IER2_I2C3IE_Msk           (0x01UL << GTZC_TZIC_IER2_I2C3IE_Pos)
#define GTZC_TZIC_IER2_I2C3IE               GTZC_TZIC_IER2_I2C3IE_Msk               /*!<  illegal access interrupt enable for I2C3 */
#define GTZC_TZIC_IER2_LPTIM1IE_Pos         (19UL)
#define GTZC_TZIC_IER2_LPTIM1IE_Msk         (0x01UL << GTZC_TZIC_IER2_LPTIM1IE_Pos)
#define GTZC_TZIC_IER2_LPTIM1IE             GTZC_TZIC_IER2_LPTIM1IE_Msk             /*!<  illegal access interrupt enable for LPTIM1 */
#define GTZC_TZIC_IER2_COMPIE_Pos           (23UL)
#define GTZC_TZIC_IER2_COMPIE_Msk           (0x01UL << GTZC_TZIC_IER2_COMPIE_Pos)
#define GTZC_TZIC_IER2_COMPIE               GTZC_TZIC_IER2_COMPIE_Msk               /*!<  illegal access interrupt enable for COMP */
#define GTZC_TZIC_IER2_ADC4IE_Pos           (24UL)
#define GTZC_TZIC_IER2_ADC4IE_Msk           (0x01UL << GTZC_TZIC_IER2_ADC4IE_Pos)
#define GTZC_TZIC_IER2_ADC4IE               GTZC_TZIC_IER2_ADC4IE_Msk               /*!<  illegal access interrupt enable for ADC4 */
#define GTZC_IER2_VREFBUFIE_Pos             (25UL)
#define GTZC_IER2_VREFBUFIE_Msk             (0x01UL << GTZC_IER2_VREFBUFPRIV_Pos)
#define GTZC_IER2_VREFBUFIE                 GTZC_IER2_VREFBUFPRIV_Msk               /*!<  illegal access interrupt enable for VREFBUF */

/*******************  Bits definition for GTZC_TZIC_IER3 register  ***************/
#define GTZC_TZIC_IER3_CRCIE_Pos            (3UL)
#define GTZC_TZIC_IER3_CRCIE_Msk            (0x01UL << GTZC_TZIC_IER3_CRCIE_Pos)
#define GTZC_TZIC_IER3_CRCIE                GTZC_TZIC_IER3_CRCIE_Msk                /*!<  illegal access interrupt enable for CRC */
#define GTZC_TZIC_IER3_TSCIE_Pos            (4UL)
#define GTZC_TZIC_IER3_TSCIE_Msk            (0x01UL << GTZC_TZIC_IER3_TSCIE_Pos)
#define GTZC_TZIC_IER3_TSCIE                GTZC_TZIC_IER3_TSCIE_Msk                /*!<  illegal access interrupt enable for TSC */
#define GTZC_TZIC_IER3_ICACHE_REGIE_Pos     (6UL)
#define GTZC_TZIC_IER3_ICACHE_REGIE_Msk     (0x01UL << GTZC_TZIC_IER3_ICACHE_REGIE_Pos)
#define GTZC_TZIC_IER3_ICACHE_REGIE         GTZC_TZIC_IER3_ICACHE_REGIE_Msk         /*!<  illegal access interrupt enable for ICACHE_REG */
#define GTZC_TZIC_IER3_OTGIE_Pos            (10UL)
#define GTZC_TZIC_IER3_OTGIE_Msk            (0x01UL << GTZC_TZIC_IER3_OTGIE_Pos)
#define GTZC_TZIC_IER3_OTGIE                GTZC_TZIC_IER3_OTGIE_Msk                /*!<  illegal access interrupt enable for OTG */
#define GTZC_TZIC_IER3_AESIE_Pos            (11UL)
#define GTZC_TZIC_IER3_AESIE_Msk            (0x01UL << GTZC_TZIC_IER3_AESIE_Pos)
#define GTZC_TZIC_IER3_AESIE                GTZC_TZIC_IER3_AESIE_Msk                /*!<  illegal access interrupt enable for AES */
#define GTZC_TZIC_IER3_HASHIE_Pos           (12UL)
#define GTZC_TZIC_IER3_HASHIE_Msk           (0x01UL << GTZC_TZIC_IER3_HASHIE_Pos)
#define GTZC_TZIC_IER3_HASHIE               GTZC_TZIC_IER3_HASHIE_Msk               /*!<  illegal access interrupt enable for HASH */
#define GTZC_TZIC_IER3_RNGIE_Pos            (13UL)
#define GTZC_TZIC_IER3_RNGIE_Msk            (0x01UL << GTZC_TZIC_IER3_RNGIE_Pos)
#define GTZC_TZIC_IER3_RNGIE                GTZC_TZIC_IER3_RNGIE_Msk                /*!<  illegal access interrupt enable for RNG */
#define GTZC_TZIC_IER3_SAESIE_Pos           (14UL)
#define GTZC_TZIC_IER3_SAESIE_Msk           (0x01UL << GTZC_TZIC_IER3_SAESIE_Pos)
#define GTZC_TZIC_IER3_SAESIE               GTZC_TZIC_IER3_SAESIE_Msk               /*!<  illegal access interrupt enable for SAES */
#define GTZC_TZIC_IER3_HSEMIE_Pos           (15UL)
#define GTZC_TZIC_IER3_HSEMIE_Msk           (0x01UL << GTZC_TZIC_IER3_HSEMIE_Pos)
#define GTZC_TZIC_IER3_HSEMIE               GTZC_TZIC_IER3_HSEMIE_Msk               /*!<  illegal access interrupt enable for HSEM */
#define GTZC_TZIC_IER3_PKAIE_Pos            (16UL)
#define GTZC_TZIC_IER3_PKAIE_Msk            (0x01UL << GTZC_TZIC_IER3_PKAIE_Pos)
#define GTZC_TZIC_IER3_PKAIE                GTZC_TZIC_IER3_PKAIE_Msk                /*!<  illegal access interrupt enable for PKA */
#define GTZC_TZIC_IER3_RAMCFGIE_Pos         (22UL)
#define GTZC_TZIC_IER3_RAMCFGIE_Msk         (0x01UL << GTZC_TZIC_IER3_RAMCFGIE_Pos)
#define GTZC_TZIC_IER3_RAMCFGIE             GTZC_TZIC_IER3_RAMCFGIE_Msk             /*!<  illegal access interrupt enable for RAMCFG */
#define GTZC_TZIC_IER3_RADIOIE_Pos          (23UL)
#define GTZC_TZIC_IER3_RADIOIE_Msk          (0x01UL << GTZC_TZIC_IER3_RADIOIE_Pos)
#define GTZC_TZIC_IER3_RADIOIE              GTZC_TZIC_IER3_RADIOIE_Msk              /*!<  illegal access interrupt enable for 2.4 GHz RADIO */
#define GTZC_TZIC_IER3_PTACONVIE_Pos        (24UL)
#define GTZC_TZIC_IER3_PTACONVIE_Msk        (0x01UL << GTZC_TZIC_IER3_PTACONVIE_Pos)
#define GTZC_TZIC_IER3_PTACONVIE            GTZC_TZIC_IER3_PTACONVIE_Msk            /*!<  illegal access interrupt enable for PTACONV */

